import "../style/descriptionOfCompany.css";

const Description = () => {
  return (
    <div className="desc">
      <span id="santionshit">Туроператор «Santionshit»</span> - это компания,
      которая предлагает уникальные и незабываемые путешествия по всему миру. Мы
      работаем с <span id="year">2011</span> года и имеем большой опыт в
      организации туров различной сложности и направленности. Наша миссия -
      сделать ваш отдых максимально <span id="accent">комфортным</span>,{" "}
      <span id="accent">интересным</span> и <span id="accent">безопасным</span>.
      Мы работаем только с <span id="accent">проверенными партнерами</span> и{" "}
      <span id="accent">гарантируем</span> высокое качество обслуживания. Наши
      менеджеры всегда готовы ответить на ваши вопросы и помочь вам выбрать
      лучший вариант отдыха. Мы ценим каждого клиента и стремимся к
      долгосрочному сотрудничеству.
    </div>
  );
};

export default Description;
